//-- includes -----
#include "AtomicPrimitives.h"
#include "PSNaviController.h"
#include "ControllerDeviceEnumerator.h"
#include "ControllerUSBDeviceEnumerator.h"
#include "ControllerHidDeviceEnumerator.h"
#include "ControllerGamepadEnumerator.h"
#include "ServerLog.h"
#include "ServerUtility.h"
#include "USBDeviceManager.h"
#include "WorkerThread.h"

#include "hidapi.h"

#include "gamepad/Gamepad.h"

#include <iostream>
#include <sstream>
#include <iomanip>
#include <algorithm>
#include <vector>
#include <cstdlib>

#ifdef _WIN32
#define _USE_MATH_DEFINES
#endif
#include <math.h>

#ifdef _MSC_VER
#pragma warning (disable: 4996) // 'This function or variable may be unsafe': sscanf
#endif

// NOTE: Details concerning low level communication with the Navi came from the SCP library 
// Forum Post: http://forums.pcsx2.net/Thread-XInput-Wrapper-for-DS3-and-Play-com-USB-Dual-DS2-Controller
// source: http://forums.pcsx2.net/attachment.php?aid=49785

//-- constants -----
#define CONTROL_TRANSFER_TIMEOUT	  500 /* timeout in ms */
#define INTERRUPT_TRANSFER_TIMEOUT	  500 /* timeout in ms */
#define HID_READ_TIMEOUT			  100 /* timeout in ms */

#define PSNAVI_CNTLR_BTADDR_BUF_SIZE 17
#define PSNAVI_HOST_BTADDR_BUF_SIZE 9
#define PSNAVI_BTADDR_SIZE 6
#define PSNAVI_STATE_BUFFER_MAX 16

// https://github.com/nitsch/moveonpc/wiki/HID-reports
enum PSNaviRequestType {
    PSNavi_Req_GetInput = 0x01,
    PSNavi_Req_GetControllerBTAddr = 0xF2,
	PSNavi_Req_GetHostBTAddr = 0xF5,

	PSNavi_Req_SetInputStreamEnabled = 0xF4,
	PSNavi_Req_SetHostBTAddr = 0xF5,
};

enum PSNaviButton {
    // https://github.com/nitsch/moveonpc/wiki/Navigation-Input-report

	// Buttons 1
	Btn_L3 = 1 << 1,
	Btn_UP = 1 << 4,
	Btn_RIGHT = 1 << 5,
	Btn_DOWN = 1 << 6,
	Btn_LEFT = 1 << 7,

    // buttons 2
	Btn_L2 = 1 << 8,
	Btn_L1 = 1 << 10,
	Btn_CIRCLE = 1 << 13,	// Red circle
	Btn_CROSS = 1 << 14,   // Blue cross

    // Buttons 3
    Btn_PS = 1 << 16,		// PS button, front center
};

// -- private definitions -----
class PSNaviAPIContext
{
public:
	int vendor_id;
	int product_id;
	std::string device_identifier;
	std::string host_bluetooth_address;
	std::string controller_bluetooth_address;

	// LibUSB state
	std::string usb_device_path;
	t_usb_device_handle usb_device_handle;

	// Gamepad state
	std::string gamepad_device_path;
	int gamepad_index;

	// HIDApi state
    std::string hid_device_path;
	std::string hid_serial_number;
	int hid_interface_number;
    hid_device *hid_device_handle;

	PSNaviAPIContext()
	{
		Reset();
	}

	void Reset()
	{
		vendor_id= -1;
		product_id= -1;
		device_identifier = "";
		host_bluetooth_address = "";
		controller_bluetooth_address = "";
		usb_device_path = "";
		usb_device_handle = k_invalid_usb_device_handle;
		gamepad_device_path = "";
		gamepad_index = -1;
		hid_device_path = "";
		hid_serial_number = "";
		hid_interface_number = -1;
		hid_device_handle = nullptr;
	}
};

struct PSNaviDataInputRawUSB {
    uint8_t type; /* message type, must be PSNavi_Req_GetInput */
	uint8_t _unk0[1];
    uint8_t buttons1; // (L3, D-pad)
    uint8_t buttons2; // (X, Circle, L1, L2)
    uint8_t buttons3; // (PS Button)
	uint8_t _unk1[1];
    uint8_t stick_xaxis; // stick value; 0..255 (subtract 0x80 to get signed values)
    uint8_t stick_yaxis; // stick value; 0..255 (subtract 0x80 to get signed values)
	uint8_t _unk2[6];
    uint8_t analog_dpad_up; // 0x00 (not pressed) to 0xff (fully pressed)
    uint8_t analog_dpad_right; // 0x00 (not pressed) to 0xff (fully pressed)
    uint8_t analog_dpad_down; // 0x00 (not pressed) to 0xff (fully pressed)
    uint8_t analog_dpad_left; // 0x00 (not pressed) to 0xff (fully pressed)
    uint8_t analog_l2; // 0x00 (not pressed) to 0xff (fully pressed)
	uint8_t _unk3[1];
    uint8_t analog_l1; // 0x00 (not pressed) to 0xff (fully pressed)
	uint8_t _unk4[2];
    uint8_t analog_circle; // 0x00 (not pressed) to 0xff (fully pressed)
    uint8_t analog_cross; // 0x00 (not pressed) to 0xff (fully pressed)
	uint8_t _unk[5];
    uint8_t battery; // 0x05 = fully charged, 0xEE = charging or 0xEF = fully charged
};

struct PSNaviDataInputHID {
	uint8_t X : 1;
	uint8_t O : 1;
	uint8_t L1 : 1;
	uint8_t L2 : 1;
	uint8_t L3 : 1;
	uint8_t PS : 1;
	uint8_t DPAD : 4;
	int16_t JX;
	int16_t JY;
	int16_t Trigger;
};
 
enum PSNaviHidDPAD {
	CENTER = 0x08,
	UP = 0x00,
	UP_RIGHT = 0x01,
	RIGHT = 0x02,
	DOWN_RIGHT = 0x03,
	DOWN = 0x04,
	DOWN_LEFT = 0x05,
	LEFT = 0x06,
	UP_LEFT = 0x07
};

// -- private prototypes -----
static std::string NaviBTAddrUcharToString(const unsigned char* addr_buff);
static bool stringToNaviBTAddrUchar(const std::string &addr, unsigned char *addr_buff, const int addr_buf_size);
inline void setButtonBit(unsigned int &buttons, unsigned int button_mask, bool is_pressed);
inline enum CommonControllerState::ButtonState getButtonState(unsigned int buttons, unsigned int lastButtons, int buttonMask);

inline uint8_t signedInt16ToUInt8(const int16_t int16_value);

