//-- includes -----
#include "PSNaviController.h"
#include "ControllerDeviceEnumerator.h"
#include "ControllerUSBDeviceEnumerator.h"
#include "ControllerGamepadEnumerator.h"
#include "ServerLog.h"
#include "ServerUtility.h"
#include "USBDeviceManager.h"

#include "gamepad/Gamepad.h"

#include <iostream>
#include <sstream>
#include <iomanip>
#include <algorithm>
#include <vector>
#include <cstdlib>

#ifdef _WIN32
#define _USE_MATH_DEFINES
#endif
#include <math.h>

#ifdef _MSC_VER
#pragma warning (disable: 4996) // 'This function or variable may be unsafe': sscanf
#endif

// NOTE: Details concerning low level communication with the Navi came from the SCP library 
// Forum Post: http://forums.pcsx2.net/Thread-XInput-Wrapper-for-DS3-and-Play-com-USB-Dual-DS2-Controller
// source: http://forums.pcsx2.net/attachment.php?aid=49785

//-- constants -----
#define CONTROL_TRANSFER_TIMEOUT	  500 /* timeout in ms */
#define INTERRUPT_TRANSFER_TIMEOUT	  500 /* timeout in ms */

#define PSNAVI_VENDOR_ID 0x054c
#define PSNAVI_PRODUCT_ID 0x042F

#define PSNAVI_CONFIGURATION_VALUE  1
#define PSNAVI_ENDPOINT_IN 0x80

#define PSNAVI_HID_INTERFACE 0

#define PSNAVI_USB_INTERFACES_MASK_TO_CLAIM ( \
	(1 << PSNAVI_HID_INTERFACE) \
)

#define PSNAVI_CNTLR_BTADDR_BUF_SIZE 17
#define PSNAVI_HOST_BTADDR_BUF_SIZE 9
#define PSNAVI_BTADDR_SIZE 6
#define PSNAVI_STATE_BUFFER_MAX 16

// https://github.com/nitsch/moveonpc/wiki/HID-reports
enum PSNaviRequestType {
    PSNavi_Req_GetInput = 0x01,
    PSNavi_Req_GetControllerBTAddr = 0xF2,
	PSNavi_Req_GetHostBTAddr = 0xF5,

	PSNavi_Req_SetInputStreamEnabled = 0xF4,
	PSNavi_Req_SetHostBTAddr = 0xF5,
};

enum PSNaviButton {
    // https://github.com/nitsch/moveonpc/wiki/Navigation-Input-report

	// Buttons 1
	Btn_L3 = 1 << 1,
	Btn_UP = 1 << 4,
	Btn_RIGHT = 1 << 5,
	Btn_DOWN = 1 << 6,
	Btn_LEFT = 1 << 7,

    // buttons 2
	Btn_L2 = 1 << 8,
	Btn_L1 = 1 << 10,
	Btn_CIRCLE = 1 << 13,	// Red circle
	Btn_CROSS = 1 << 14,   // Blue cross

    // Buttons 3
    Btn_PS = 1 << 16,		// PS button, front center
};

// -- private definitions -----
class PSNaviAPIContext
{
public:
	int vendor_id;
	int product_id;
	std::string device_identifier;
	std::string host_bluetooth_address;
	std::string controller_bluetooth_address;

	// LibUSB state
	std::string usb_device_path;
	t_usb_device_handle usb_device_handle;

	// Gamepad state
	std::string gamepad_device_path;
	int gamepad_index;

	PSNaviAPIContext()
	{
		Reset();
	}

	void Reset()
	{
		vendor_id= -1;
		product_id= -1;
		device_identifier = "";
		host_bluetooth_address = "";
		controller_bluetooth_address = "";
		usb_device_path = "";
		usb_device_handle = k_invalid_usb_device_handle;
		gamepad_device_path = "";
		gamepad_index = -1;
	}
};

struct PSNaviDataInput {
    unsigned char type; /* message type, must be PSNavi_Req_GetInput */
	unsigned char _unk0[1];
    unsigned char buttons1; // (L3, D-pad)
    unsigned char buttons2; // (X, Circle, L1, L2)
    unsigned char buttons3; // (PS Button)
	unsigned char _unk1[1];
    unsigned char stick_xaxis; // stick value; 0..255 (subtract 0x80 to get signed values)
    unsigned char stick_yaxis; // stick value; 0..255 (subtract 0x80 to get signed values)
	unsigned char _unk2[6];
    unsigned char analog_dpad_up; // 0x00 (not pressed) to 0xff (fully pressed)
    unsigned char analog_dpad_right; // 0x00 (not pressed) to 0xff (fully pressed)
    unsigned char analog_dpad_down; // 0x00 (not pressed) to 0xff (fully pressed)
    unsigned char analog_dpad_left; // 0x00 (not pressed) to 0xff (fully pressed)
    unsigned char analog_l2; // 0x00 (not pressed) to 0xff (fully pressed)
	unsigned char _unk3[1];
    unsigned char analog_l1; // 0x00 (not pressed) to 0xff (fully pressed)
	unsigned char _unk4[2];
    unsigned char analog_circle; // 0x00 (not pressed) to 0xff (fully pressed)
    unsigned char analog_cross; // 0x00 (not pressed) to 0xff (fully pressed)
	unsigned char _unk[5];
    unsigned char battery; // 0x05 = fully charged, 0xEE = charging or 0xEF = fully charged
};

// -- private prototypes -----
static std::string NaviBTAddrUcharToString(const unsigned char* addr_buff);
static bool stringToNaviBTAddrUchar(const std::string &addr, unsigned char *addr_buff, const int addr_buf_size);
inline void setButtonBit(unsigned int buttons, unsigned int button_bit, bool is_pressed);
inline enum CommonControllerState::ButtonState getButtonState(unsigned int buttons, unsigned int lastButtons, int buttonMask);

static int psnavi_get_usb_feature_report(t_usb_device_handle device_handle, unsigned char *report_bytes, size_t report_size);
static int psnavi_send_usb_feature_report(t_usb_device_handle device_handle, unsigned char *report_bytes, size_t report_size);
static int psnavi_read_usb_interrupt_pipe(t_usb_device_handle device_handle, unsigned char *buffer, size_t max_buffer_size);

// -- public methods

// -- PSMove Controller Config
const boost::property_tree::ptree
